In [3]:
# Show instowalled version
import pandas as pd
pd.__version__

'1.1.3'

In [2]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : db08276bc116c438d3fdee492026f8223584c477
python           : 3.8.5.final.0
python-bits      : 64
OS               : Windows
OS-release       : 7
Version          : 6.1.7601
machine          : AMD64
processor        : Intel64 Family 6 Model 58 Stepping 9, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.1.3
numpy            : 1.19.2
pytz             : 2020.1
dateutil         : 2.8.1
pip              : 20.2.4
setuptools       : 50.3.1.post20201107
Cython           : 0.29.21
pytest           : 6.1.1
hypothesis       : None
sphinx           : 3.2.1
blosc            : None
feather          : None
xlsxwriter       : 1.3.7
lxml.etree       : 4.6.1
html5lib         : 1.1
pymysql          : None
psycopg2         : None
jinja2           : 2.11.2
IPython          : 7.19.0
pandas_datareader: None
bs4              : 4.9.3
bottleneck       : 1.3.2
fsspec           : 0.8.3
fastparquet      : None
gcsfs            : None
matplotlib       : 3.3.2
numexpr          : 2.7.1
odfpy            : None
openpyxl         : 3.0.5
pandas_gbq       : None
pyarrow          : None
pytables         : None
pyxlsb           : None
s3fs             : None
scipy            : 1.5.2
sqlalchemy       : 1.3.20
tables           : 3.6.1
tabulate         : None
xarray           : None
xlrd             : 1.2.0
xlwt             : 1.3.0
numba            : 0.51.2

2.Create dataframe different ways

In [6]:
# using dictionary key values pair
df=pd.DataFrame({'col one':[100,200],'Col two':[400,300]})

df

   col one  Col two
0      100      400
1      200      300

In [4]:
# using randomfunction
import numpy as np
pd.DataFrame(np.random.rand(4,2))

          0         1
0  0.609343  0.329730
1  0.017212  0.832089
2  0.513111  0.748142
3  0.002876  0.832926

In [5]:
pd.DataFrame(np.random.rand(4,4),columns=list('abcd'))

          a         b         c         d
0  0.677605  0.941695  0.287718  0.998041
1  0.725362  0.155566  0.794251  0.752630
2  0.753543  0.158964  0.119668  0.553167
3  0.053811  0.412806  0.648556  0.562849

# RENAME COLUMN

In [12]:
# it is used to rename any no of columns
df=df.rename({'col one':'Col_one','Col two':'Col_two'},axis='columns')

In [13]:
df

   Col_one  Col_two
0      100      400
1      200      300

In [14]:
# 2nd way
df.columns=['COLUMN ONE','COLUMN TWO']

In [16]:
df

   COLUMN ONE  COLUMN TWO
0         100         400
1         200         300

In [18]:
type(df.columns)

pandas.core.indexes.base.Index

In [19]:
# if we just want to replace some particular value in all the columns then,
df.columns=df.columns.str.replace(' ','_') # replace space in column with underscore
df

   COLUMN_ONE  COLUMN_TWO
0         100         400
1         200         300

In [20]:
df.add_prefix('X') # add prefrix to all the columns

   XCOLUMN_ONE  XCOLUMN_TWO
0          100          400
1          200          300

In [21]:
df.add_suffix('Y')

   COLUMN_ONEY  COLUMN_TWOY
0          100          400
1          200          300

# 4.REVERSE THE COLUMNS

In [22]:
df1=pd.read_csv('headbrain.csv')

In [24]:
df1.head()

   Gender  AgeRange  HeadSize  BrainWeight
0       1         1      4512         1530
1       1         1      3738         1297
2       1         1      4261         1335
3       1         1      3777         1282
4       1         1      4177         1590

In [26]:
df1[::-1].head()

     Gender  AgeRange  HeadSize  BrainWeight
236       2         2      3391         1120
235       2         2      3352         1170
234       2         2      3233         1104
233       2         2      3394         1215
232       2         2      3214         1110

In [27]:
df1[::-1].reset_index(drop=True).head()

   Gender  AgeRange  HeadSize  BrainWeight
0       2         2      3391         1120
1       2         2      3352         1170
2       2         2      3233         1104
3       2         2      3394         1215
4       2         2      3214         1110

In [28]:
df1.loc[:,::-1].head() # reversing column

   BrainWeight  HeadSize  AgeRange  Gender
0         1530      4512         1       1
1         1297      3738         1       1
2         1335      4261         1       1
3         1282      3777         1       1
4         1590      4177         1       1

6. SELECTING COLUMNS BY DATA TYPE

In [30]:
df1.select_dtypes(include='number').head()  # select column with number mesns int type

   Gender  AgeRange  HeadSize  BrainWeight
0       1         1      4512         1530
1       1         1      3738         1297
2       1         1      4261         1335
3       1         1      3777         1282
4       1         1      4177         1590

In [ ]:
df1.select_dtypes(include='number').head()  # select column with number mesns int type
df1.select_dtypes(include=['number','object','category').head()  # select column with number,object and category mesns int type
df1.select_dtypes(exclude='number').head()  # select column without number mesns int type

In [34]:
df.dtypes

COLUMN_ONE    int64
COLUMN_TWO    int64
dtype: object

# 7.CONVERT STRINGS TO NUMBERS

In [35]:
df

   COLUMN_ONE  COLUMN_TWO
0         100         400
1         200         300

In [37]:
# convert data type to float
df.astype({'COLUMN_ONE':'float','COLUMN_TWO':'string'}).dtypes

COLUMN_ONE    float64
COLUMN_TWO     string
dtype: object

In [38]:
pd.to_numeric(df.COLUMN_TWO)# convert to numeric data

0    400
1    300
Name: COLUMN_TWO, dtype: int64

In [40]:
for index,row in df.iterrows():
    print(index,row)

0 COLUMN_ONE    100
COLUMN_TWO    400
Name: 0, dtype: int64
1 COLUMN_ONE    200
COLUMN_TWO    300
Name: 1, dtype: int64

# CHANGES TO DATA

In [42]:
df2=df1.copy()
print(df2.columns)

Index(['Gender', 'AgeRange', 'HeadSize', 'BrainWeight'], dtype='object')

In [44]:
lf=df2[['Gender','HeadSize']]  # way to select multiple columns
lf

     Gender  HeadSize
0         1      4512
1         1      3738
2         1      4261
3         1      3777
4         1      4177
..      ...       ...
232       2      3214
233       2      3394
234       2      3233
235       2      3352
236       2      3391

[237 rows x 2 columns]

In [46]:
cols=list(df2.columns.values)
print(cols)

['Gender', 'AgeRange', 'HeadSize', 'BrainWeight']

In [52]:
df2[cols]

     Gender  AgeRange  HeadSize  BrainWeight
0         1         1      4512         1530
1         1         1      3738         1297
2         1         1      4261         1335
3         1         1      3777         1282
4         1         1      4177         1590
..      ...       ...       ...          ...
232       2         2      3214         1110
233       2         2      3394         1215
234       2         2      3233         1104
235       2         2      3352         1170
236       2         2      3391         1120

[237 rows x 4 columns]

In [8]:
a1=[1,2,3,5]
a1[::-1]

[5, 3, 2, 1]

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns
import p

plt.title("vikas")
plt.xlabel{}